## Group By

In [4]:
import pandas as pd
data={'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],'Person':['Sam','Charlie','Amy','Vanesa','Carl','Sarah'],'Sales':[200,120,340,124,243,350]}

In [6]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT   Vanesa    124
4      FB     Carl    243
5      FB    Sarah    350

In [9]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

## Handling Missing Value

In [11]:
import numpy as np

In [38]:
df1 = pd.DataFrame({'A': [1,2,np.nan],
                   'B' : [5,np.nan,np.nan],
                   'C' : [1,2,3]})

In [34]:
df1

   A    B  C
0  1    5  1
1  2  NaN  2
2          3

In [35]:
df1.isnull().sum()

A    0
B    1
C    0
dtype: int64

In [17]:
df1.dropna() #menghapus NA

     A    B  C
0  1.0  5.0  1

In [19]:
df1.dropna(axis=1)

   C
0  1
1  2
2  3

In [24]:
df1.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [30]:
df1['A'].fillna(value=df1['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [40]:
df1.fillna(method = 'ffill')

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

In [41]:
df1.fillna(method = 'bfill')

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

## Example DataFrames

In [66]:
df2 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                   'B' : ['B0', 'B1', 'B2', 'B3'],
                   'C' : ['C0', 'C1', 'C2', 'C3'],
                   'D' : ['D0', 'D1', 'D2', 'D3']},
                  index=[0,1,2,3]);

In [65]:
df3 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                   'B' : ['B4', 'B5', 'B6', 'B7'],
                   'C' : ['C4', 'C5', 'C6', 'C7'],
                   'D' : ['D4', 'D5', 'D6', 'D7']},
                  index=[4,5,6,7]);

### Concat

In [45]:
pd.concat([df2,df3]) #concate baris

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [50]:
pd.concat([df2,df3], axis=1) #concate column

     A    B    C    D    A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   A4   B4   C4   D4
5  NaN  NaN  NaN  NaN   A5   B5   C5   D5
6  NaN  NaN  NaN  NaN   A6   B6   C6   D6
7  NaN  NaN  NaN  NaN   A7   B7   C7   D7

### MERGE

In [57]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                    'A': ['A0', 'A1', 'A2', 'A3'],
                    'B' : ['B0', 'B1', 'B2', 'B3']});

right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D' : ['D0', 'D1', 'D2', 'D3']});

right2 = pd.DataFrame({'key': ['K0', 'K1'],
                    'C': ['C0', 'C1'],
                    'D' : ['D0', 'D1']});

In [62]:
pd.merge(left,right2,how='outer',on='key')

    A   B key    C    D
0  A0  B0  K0   C0   D0
1  A1  B1  K1   C1   D1
2  A2  B2  K2  NaN  NaN
3  A3  B3  K3  NaN  NaN

### JOIN

In [72]:
join1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                   'B' : ['B0', 'B1', 'B2', 'B3']},
                  index=['K0','K1','K2','K3']);
join2 = pd.DataFrame({'C' : ['C0', 'C1', 'C2'],
                   'D' : ['D0', 'D1', 'D2']},
                 index=['K0','K1','K2']);

In [73]:
join1.join(join2, how='right')

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2